<script setup lang="ts">

const isAuthored = () => {
  const {loggedIn} = useUserSession();
  return loggedIn.value;
}

</script>

<template>
  <Tabs value="welcome" class="w-full p-4">
    <TabList>
      <Tab value="welcome">Общее описание</Tab>
      <Tab value="offer">Публичная оферта</Tab>
      <Tab v-if="isAuthored()" value="instruction">Инструкция по использованию</Tab>
      <Tab v-if="isAuthored()" value="browserExtension">Расширение для браузера</Tab>
    </TabList>
    <TabPanels>
      <TabPanel value="welcome">
        <h1 class="font-bold">Приложение для формирования публикаций и ответов на отзывы с применением искусственного интеллекта</h1>
        <p>Публикации формируются путем выбора изображения из набора продуктов компании и генерации искусственным интеллектом
           подходящей статьи, формируемой на основе одного из базовых промптов или самостоятельно составленного промпта.</p>
        <p>При подключении приложения к кабинетам агрегаторов, (таких как Яндекс-бизнес, Авито ...) приложение
           следит за появлением новых отзывов, при поступлении агрегирует их во внутренней базе данных,
           запускает формирование ответа с использованием искусственного интеллекта. В зависимости от настройки,
           ответ либо сразу публикуется в привязке к соответствующему отзыву, либо ожидает подтверждения для
           публикации от ответственного лица.</p>
        <br><h1 class="font-bold">Условия начала использования</h1>
        <p>Для начала использования приложения нужно пройти регистрацию в системе и подтвердить её путем перехода
           по ссылке в письме, которое придёт на электронную почту, указанную при регистрации. Особое внимание при
           регистрации нужно обратить на наименование компании, оно должно полностью совпадать с тем, как ваша
           компания называется в кабинетах агрегаторов (Яндекс-бизнес, Авито ...). После подтверждения
           регистрации, при входе в приложение с указанными реквизитами, будет доступно меню с основным
           функционалом приложения. Необходимо заполнить данные вашей организации, указать номенклатуру
           продукции/услуг, эти данные будут использоваться алгоритмами искусственного интеллекта при
           формировании публикаций и ответов на отзывы ваших пользователей.</p>
        <p>Путём выбора услуг в пункте меню "Лицевой счёт" или через сотрудников компании
           ООО "Технологии третьего тысячелетия", контактное лицо - Анатолий Викторович Кузенков тел. +7(922)014-64-91,
           email компании - business@t3t.online, вы определяете набор используемого вами функционала приложения и
           дополнительных услуг компании. Определив объём предоставляемых услуг, вы тем самым соглашаетесь с
           условиями их предоставления, опубликованными на странице публичной оферты. Все услуги начинают
           предоставляться только после внесения авансового платежа. Фиксация фактического объёма предоставленных
           услуг и погашение соответствующих средств из аванса, осуществляется с 25 по 28 число месяца
           (в один из рабочих дней).</p>
      </TabPanel>
      <TabPanel value="offer">
      </TabPanel>
      <TabPanel v-if="isAuthored()" value="instruction">

      </TabPanel>
      <TabPanel v-if="isAuthored()" value="browserExtension">

      </TabPanel>
    </TabPanels>
  </Tabs>
</template>

<style scoped>

</style>